11/data/attachments/828fa7bf874593a0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_9c581f7f-539e-4ef5-9729-453a7ac2136f</nif:username>
            <nif:friendToBeAdded>Derek_decision_Actions_49929_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>